@extends('layouts.layout')
@section('title', 'LibraryAI')
@section('content')
    <div class="main-page">
        <div class="main-section">
            <div class="section-text">
                <h2>Чт0 так0е искусственный интелект?</h2>
                <p>Это интеллект, демонстрируемый машинами, в частности компьютерными системами. Это область исследований в области компьютерных наук, которая разрабатывает и изучает методы и программное обеспечение, позволяющие машинам воспринимать окружающую среду и использовать обучение и интеллект для выполнения действий, которые максимально увеличивают их шансы на достижение поставленных целей.</p>
            </div>
            <div class="section-image">
                <img src="/public/assets/images/main-page.png" alt="Раздел 1">
            </div>
        </div>
        <div class="main-section">
            <div class="section-image">
                <img src="/public/assets/images/main-page2.png" alt="Раздел 2">
            </div>
            <div class="section-text">
                <h2>Применение ИИ в жизни</h2>
                <p>Искусственный интеллект уже сегодня помогает в повседневной жизни:
                    он управляет голосовыми помощниками, фильтрует спам,
                    рекомендует фильмы и товары, поддерживает безопасность в городах
                    и помогает врачам точнее ставить диагнозы.</p>
            </div>
        </div>
        <div class="main-section">
            <div class="section-text">
                <h2>Практика и эксперименты</h2>
                <p>В практическом применении ИИ исследователи проводят эксперименты с обучением моделей:
                    например, нейросети учат распознавать эмоции по лицу, генерировать изображения по тексту
                    или создавать музыку. Один из примеров — ИИ, способный по голосу определить настроение человека,
                    что используется в колл-центрах для повышения качества обслуживания.</p>
            </div>
            <div class="section-image">
                <img src="/public/assets/images/main-page3.jpg" alt="Раздел 3">
            </div>
        </div>
        <div class="main-section">
            <div class="section-image">
                <img src="/public/assets/images/main-page4.jpg" alt="Раздел 4">
            </div>
            <div class="section-text">
                <h2>Этика и будущее ИИ</h2>
                <p>Развитие искусственного интеллекта вызывает важные этические вопросы:
                    как обеспечить прозрачность алгоритмов, кто несёт ответственность за ошибки ИИ
                    и как защитить частные данные. В будущем ИИ может трансформировать медицину,
                    образование и транспорт, но важно направлять его развитие ответственно и гуманно.</p>
            </div>
        </div>
    </div>
@endsection

